/*
Написать функцию, которая принимает на входе любое число (но не больше 1 000), 
определяет, является ли оно простым, и выводит простое число или нет. 
Если введено больше 1 000, то выводится сообщение, что данные неверны. Обратите внимание на числа 0 и 1.

// 11.2

*/


function isPrimeNum(val) {
  if ( val >= 1000 ) {
    a = 'Данные неверны';
    return a;
  }
  for ( let i = 2; i < val; i++ ) {
    if ( val % i === 0 ) {
      return false;
    }
  }
  return val > 1;
}

console.log(isPrimeNum(11115));